{"backend": "tensorflow", "keras_version": "2.2.4", "class_name": "Sequential", "config": {"layers": [{"class_name": "Lambda", "config": {"function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgX0DnAAAAAAAA\n8D+pACkB2gF4cgMAAAByAwAAAPoIbW9kZWwucHnaCDxsYW1iZGE+PwAAAHMAAAAA\n", null, null], "output_shape": null, "name": "lambda_1", "arguments": {}, "batch_input_shape": [null, 160, 320, 3], "function_type": "lambda", "output_shape_type": "raw", "trainable": true, "dtype": "float32"}}, {"class_name": "Cropping2D", "config": {"data_format": "channels_last", "name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "cropping": [[70, 25], [0, 0]], "dtype": "float32", "trainable": true}}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [4, 4], "trainable": true, "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_size": [8, 8], "bias_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_1", "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "trainable": true, "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_size": [5, 5], "bias_regularizer": null}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_2", "alpha": 1.0}}, {"class_name": "Conv2D", "config": {"use_bias": true, "data_format": "channels_last", "bias_constraint": null, "activation": "linear", "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null, "padding": "same", "name": "conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "trainable": true, "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "kernel_size": [5, 5], "bias_regularizer": null}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "noise_shape": null, "rate": 0.2}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_3", "alpha": 1.0}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 512, "activation": "linear", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1", "bias_constraint": null}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_2", "noise_shape": null, "rate": 0.5}}, {"class_name": "ELU", "config": {"trainable": true, "name": "elu_4", "alpha": 1.0}}, {"class_name": "Dense", "config": {"use_bias": true, "units": 1, "activation": "linear", "kernel_constraint": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_2", "bias_constraint": null}}], "name": "sequential_1"}}