{"class_name": "Sequential", "config": {"layers": [{"class_name": "Lambda", "config": {"trainable": true, "function": ["4wEAAAAAAAAAAQAAAAIAAABDAAAAcwwAAAB8AABkAQAbZAIAGFMpA07nAAAAAADgX0DnAAAAAAAA\n8D+pACkB2gF4cgMAAAByAwAAAPoIbW9kZWwucHnaCDxsYW1iZGE+QAAAAHMAAAAA\n", null, null], "dtype": "float32", "arguments": {}, "function_type": "lambda", "output_shape_type": "raw", "output_shape": null, "batch_input_shape": [null, 160, 320, 3], "name": "lambda_1"}}, {"class_name": "Cropping2D", "config": {"trainable": true, "cropping": [[70, 25], [0, 0]], "dtype": "float32", "name": "cropping2d_1", "batch_input_shape": [null, 160, 320, 3], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_1", "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [8, 8], "activity_regularizer": null, "padding": "same", "strides": [4, 4], "filters": 16, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_2", "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [5, 5], "activity_regularizer": null, "padding": "same", "strides": [2, 2], "filters": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}}, {"class_name": "Conv2D", "config": {"trainable": true, "kernel_regularizer": null, "bias_constraint": null, "name": "conv2d_3", "activation": "linear", "kernel_constraint": null, "dilation_rate": [1, 1], "data_format": "channels_last", "bias_regularizer": null, "kernel_size": [5, 5], "activity_regularizer": null, "padding": "same", "strides": [2, 2], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "noise_shape": null, "seed": null, "name": "dropout_1"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "units": 512, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "noise_shape": null, "seed": null, "name": "dropout_2"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_4"}}, {"class_name": "Dense", "config": {"trainable": true, "kernel_regularizer": null, "kernel_constraint": null, "activation": "linear", "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_regularizer": null, "activity_regularizer": null, "units": 1, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true}}], "name": "sequential_1"}, "backend": "tensorflow", "keras_version": "2.2.4"}